Revit 2024 API
InitialIlluminanceIntensity Constructor (InitialIlluminanceIntensity)
 Creates a copy of the given initial illuminance intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public InitialIlluminanceIntensity(
	InitialIlluminanceIntensity other
)
Visual Basic
Public Sub New ( _
	other As InitialIlluminanceIntensity _
)
Visual C++
public:
InitialIlluminanceIntensity(
	InitialIlluminanceIntensity^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
InitialIlluminanceIntensity Class
InitialIlluminanceIntensity Overload
Autodesk.Revit.DB.Lighting Namespace